<?php

return [

    /*
        |--------------------------------------------------------------------------
        | Messgaes Language Lines
        |--------------------------------------------------------------------------
        |
        | The following language lines are used during Messgaes for various
        | messages that we need to display to the user. You are free to modify
        | these language lines according to your application's requirements.
        |
        */
    // សារលេខកូដ
    '200' => 'សំណើបានជោគជ័យ។',
    '401' => 'អ្នកមិនត្រូវបានអនុញ្ញាតឱ្យចូលប្រើទំព័រនេះទេ។',
    '402' => 'តម្រូវឱ្យបង់ប្រាក់',
    '403' => 'អ្នកមិនមានការអនុញ្ញាតចាំបាច់ដើម្បីចូលប្រើទំព័រនេះទេ។',
    '404' => 'ទំព័រដែលអ្នកកំពុងស្វែងរកមិនអាចរកឃើញទេ។',
    '405' => 'វិធីសាស្រ្តមិនត្រូវបានអនុញ្ញាត',
    '419' => 'ទំព័រផុតកំណត់',
    '500' => 'កំហុសម៉ាស៊ីនមេ',
    '503' => 'សេវាកម្មមិនអាចប្រើបាន',
    // សារ

    'access_denied' => 'អ្នកមិនមានសិទ្ធិដែលត្រូវបានទទួលបានដើម្បីចូលទៅទំព័រនេះទេ។',
    'user_saved' => 'អ្នកប្រើប្រាស់ត្រូវបានរក្សាទុកដោយជោគជ័យ',
    'user_updated' => 'អ្នកប្រើប្រាស់ត្រូវបានធ្វើបច្ចុប្បន្នភាពដោយជោគជ័យ',
    'user_deleted' => 'អ្នកប្រើប្រាស់ត្រូវបានលុបដោយជោគជ័យ',
    'user_cannot_delete' => 'អ្នកមិនអាចលុបអ្នកប្រើប្រាស់នេះបានទេ',
    'role_saved' => 'តួនាទីត្រូវបានរក្សាទុកដោយជោគជ័យ',
    'role_updated' => 'តួនាទីត្រូវបានធ្វើបច្ចុប្បន្នភាពដោយជោគជ័យ',
    'role_deleted' => 'តួនាទីត្រូវបានលុបដោយជោគជ័យ',
    'role_cannot_delete' => 'អ្នកមិនអាចលុបតួនាទីនេះបានទេ',
    'password_changed' => 'ពាក្យសម្ងាត់ត្រូវបានផ្លាស់ប្តូរដោយជោគជ័យ',
    'are_you_sure' => 'តើអ្នកប្រាកដទេ?',
    'you_want_to_delete' => 'តើអ្នកប្រហែលជាចង់លុបកំណត់ហេតុនេះមែនទេ',
    'yes_delete' => 'បាទ, លុប',
    'no_cancel' => 'ទេ, បោះបង់',
    'yes_clear' => 'បាទ, សម្អាត',
    'you_want_to_restore' => 'តើអ្នកប្រហែលជាចង់ស្ដារកំណត់ហេតុនេះមែនទេ',
    'yes_restore' => 'បាទ, ស្ដារ',
    'you_want_to_logout' => 'តើអ្នកប្រហែលជាចង់ចាកចេញចេញពីប្រព័ន្ធនេះមែនទេ',
    'yes_logout' => 'បាទ, ចាកចេញ',
];
